# General Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..General Property
UnitTypeId Class See Also
---
General.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId General { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property General As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ General {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace